import random
def num1():
    """
    1. Создать массив в виде вектора и вывести на экран.
    """
    vector = [i for i in range(1, 11)]  # вектор от 1 до 10
    print("Созданный вектор:", vector)

def num2():
    """
    2. Считать вектор с клавиатуры, оформить и вывести на экран.
    """
    text = input("Введите элементы вектора через пробел: ")
    vector = list(map(int, text.split()))
    print("Введённый вектор: ", vector)

def num3():
    """
    3. Создать вектор, заполнить генератором случайных значений и вывести на экран.
    """
    vector = [random.randint(0, 100) for _ in range(10)]  # Вектор из 10 случайных чисел от 0 до 100
    print("Случайный вектор:", vector)

def num4(filename):
    """
    4. Создать вектор и заполнить его случайными значениями в диапазоне,
       считанном с клавиатуры, и записать в файл.
    """
    
    d_bound = int(input("Введите нижнюю границу диапазона: "))
    u_bound = int(input("Введите верхнюю границу диапазона: "))
    if d_bound > u_bound:
        print("Нижняя граница должна быть меньше или равна верхней.")

    vector = [random.randint(d_bound, u_bound) for _ in range(10)]
    print("Случайный вектор в заданном диапазоне: ", vector)

    with open(filename, "w") as file:
        file.write(" ".join(map(str, vector)))
    print(f"Вектор успешно записан в файл: {filename}")
    

def main():
    """
    Основная функция для выбора задания.
    """
    filename = "2_laba.txt"
    while True:
        print("\nВыберите действие:")
        print("1 - Создать массив в виде вектора и вывести на экран")
        print("2 - Считать вектор с клавиатуры, оформить и вывести на экран")
        print("3 - Создать вектор, заполнить генератором случайных значений и вывести на экран")
        print("4 - Создать вектор, заполнить случайными значениями в диапазоне и записать в файл")
        print("0 - Выход")

        choice = input("Введите номер действия: ")

        if choice == "1":
            num1()
        elif choice == "2":
            num2()
        elif choice == "3":
            num3()
        elif choice == "4":
            num4(filename)
        elif choice == "0":
            print("Выход из программы.")
            break
        else:
            print("Неверный выбор. Попробуйте снова.")

main()